app/views/blogs/index.html.erb

SELECT "blogs".* FROM "blogs" WHERE "blogs"."ispublished" = 0 ORDER BY blogs.created_at DESC
SELECT COUNT(*) FROM "blogs" INNER JOIN "taggings" ON "blogs"."id" = "taggings"."blog_id" WHERE "taggings"."tag_id" = 4 AND "blogs"."ispublished" = 1
---
                              <li class="nav-header"></li>
                              <li class="active"><%= link_to "All" + " ( #{Blog.where(ispublished: 1).all.size} )", blogs_path %></a></li>
                              <% @tags.each do |tag| %>
                                  <% @tagStructure = tag.name + " ( #{ tag.blogs.where(ispublished: 1).size} )" %>