app/views/topics/show.html.erb

SELECT "courses".* FROM "courses" WHERE "courses"."ispublished" = 1 ORDER BY courses.created_at DESC
SELECT COUNT(*) FROM "courses" INNER JOIN "relationships" ON "courses"."id" = "relationships"."course_id" WHERE "relationships"."topic_id" = 4 AND "courses"."ispublished" = 1
---
  <div class="page-header">
    <% @topicStructure = @topic.name + " ( #{@topic.courses.where(ispublished: 1).size} )" %>

SELECT "courses".* FROM "courses" INNER JOIN "relationships" ON "courses"."id" = "relationships"."course_id" WHERE "relationships"."topic_id" = 3 ORDER BY courses.created_at DESC
---

                    <% @topic.courses.each do |course| %>