app/views/tutorials/index.html.erb

SELECT "tutorials".* FROM "tutorials" WHERE "tutorials"."ispublished" = 0 ORDER BY tutorials.created_at DESC
SELECT COUNT(*) FROM "tutorials" WHERE "tutorials"."ispublished" = 1
SELECT COUNT(*) FROM "tutorials" INNER JOIN "groupings" ON "tutorials"."id" = "groupings"."tutorial_id" WHERE "groupings"."group_id" = 4 AND "tutorials"."ispublished" = 1
---
                              <li class="nav-header"></li>
                              <li class="active"><%= link_to "All" + " ( #{Tutorial.where(ispublished: 1).all.size} )", tutorials_path %></a></li>
                              <% @groups.each do |group| %>
                                  <% @groupStructure = group.name + " ( #{ group.tutorials.where(ispublished: 1).size} )" %>