app/controllers/courses_controller.rb

SELECT "courses".* FROM "courses" WHERE "courses"."ispublished" = 1 ORDER BY courses.created_at DESC LIMIT 5 OFFSET 0
SELECT COUNT(*) FROM "courses" WHERE "courses"."ispublished" = 1
SELECT "topics".* FROM "topics" ORDER BY name
---
	def index
		@countCoursesPerPage = 5
<<<<<<< HEAD
    	@courses = Course.where(ispublished: 1).paginate(page: params[:page], per_page: 5)
		@topics = Topic.order(:name)